{"id":"MFI","segmentId":"MFI","longName":"Master File Identification","description":"The Technical Steward for the MFI segment is CQ.","sample":"","chapters":["CH_08"],"fields":[{"id":"MFI.1","type":"Field","position":"MFI.1","name":"Master File Identifier","length":250,"usage":"R","rpt":"1","dataType":"CE","dataTypeName":"Coded Element","tableId":"0175","tableName":"Master file identifier code","description":"This field is a CE data type that identifies a standard HL7 master file. This table may be extended by local agreement during implementation to cover site-specific master files (z-master files). HL7 recommends use of the HL7 assigned table number as the master file identifier code if one is not specified in Table 0175. For example, a master file of Marital Status codes would be identified by HL70002 as the MFI-1 - Master file identifier . Refer to HL7 table 0175 - Master file identifier code for valid values.","sample":"","fields":[]},{"id":"MFI.2","type":"Field","position":"MFI.2","name":"Master File Application Identifier","length":180,"usage":"O","rpt":"1","dataType":"HD","dataTypeName":"Hierarchic Designator","tableId":null,"tableName":null,"description":"This field contains an optional code of up to 180 characters which (if applicable) uniquely identifies the application responsible for maintaining this file at a particular site. A group of intercommunicating applications may use more than a single instance of a master file of certain type (e.g., charge master or physician master). The particular instance of the file is identified by this field.","sample":"","fields":[]},{"id":"MFI.3","type":"Field","position":"MFI.3","name":"File-Level Event Code","length":3,"usage":"R","rpt":"1","dataType":"ID","dataTypeName":"Coded values for HL7 tables","tableId":"0178","tableName":"File level event code","description":"This field defines the file-level event code. Refer toHL7 table 0178 - File level event code for valid values.","sample":"","fields":[]},{"id":"MFI.4","type":"Field","position":"MFI.4","name":"Entered Date/Time","length":26,"usage":"O","rpt":"1","dataType":"TS","dataTypeName":"Time Stamp","tableId":null,"tableName":null,"description":"This field contains the time stamp for file-level event on originating system.","sample":"","fields":[]},{"id":"MFI.5","type":"Field","position":"MFI.5","name":"Effective Date/Time","length":26,"usage":"O","rpt":"1","dataType":"TS","dataTypeName":"Time Stamp","tableId":null,"tableName":null,"description":"This optional field contains the effective date/time, which can be included for file-level action specified. It is the date/time the originating system expects that the event is to have been completed on the receiving system. If this field is not present, the action date/time should default to the current date/time (when the message is received).","sample":"","fields":[]},{"id":"MFI.6","type":"Field","position":"MFI.6","name":"Response Level Code","length":2,"usage":"R","rpt":"1","dataType":"ID","dataTypeName":"Coded values for HL7 tables","tableId":"0179","tableName":"Response level","description":"These codes specify the application response level defined for a given Master File Message at the MFE segment level as defined in HL7 table 0179 - Response level. Required for MFN-Master File Notification message. Specifies additional detail (beyond MSH-15 - Accept acknowledgment type and MSH-16 - Application acknowledgment type) for application-level acknowledgment paradigms for Master Files transactions. MSH-15 - accept acknowledgment type andMSH-16 - Application acknowledgment type operate as defined in Chapter 2.","sample":"","fields":[]}]}