{"id":"CTD","segmentId":"CTD","longName":"Contact Data","description":"The CTD segment may identify any contact personnel associated with a patient referral message and its related transactions. The CTD segment will be paired with a PRD segment. The PRD segment contains data specifically focused on provider information in a referral. While it is important in an inter-enterprise transaction to transmit specific information regarding the providers involved (referring and referred-to), it may also be important to identify the contact personnel associated with the given provider. For example, a provider receiving a referral may need to know the office manager or the billing person at the institution of the provider who sent the referral. This segment allows for multiple contact personnel to be associated with a single provider.","sample":"","chapters":["CH_11"],"fields":[{"id":"CTD.1","type":"Field","position":"CTD.1","name":"Contact Role","length":250,"usage":"R","rpt":"*","dataType":"CE","dataTypeName":"Coded Element","tableId":"0131","tableName":"Contact role","description":"This field contains the contact role that defines the relationship of the person described in this segment to the patient being referred. When a referral is inter-enterprise in nature, there are some important relationships that must be identified. For example, it may be necessary to identify the contact representative at the clinic that sent the referral. User-defined Table 0131 - Contact role is used as the HL7 identifier for the user-defined table of values for this field.","sample":"","fields":[]},{"id":"CTD.2","type":"Field","position":"CTD.2","name":"Contact Name","length":250,"usage":"O","rpt":"*","dataType":"XPN","dataTypeName":"Extended Person Name","tableId":null,"tableName":null,"description":"This field contains the name of the contact person identified in this segment. Generally, this field will describe a person or provider associated with the referral. If this contact name is a physician, you may refer to the CTD-7-Contact identifiers (Section 11.6.4.7) for the physician identifier.","sample":"","fields":[{"id":"CTD.2.8","type":"Component","position":"CTD.2.8","name":"Name Representation Code","length":0,"usage":"O","rpt":"1","dataType":"ID","dataTypeName":"Coded values for HL7 tables","tableId":"0465","tableName":"Name/address representation","description":"Different <name/address types> and representations of the same <name/address> should be described by repeating of this field, with different values of the <name/address type> and/or <name/address representation> component.","sample":"","fields":[]}]},{"id":"CTD.3","type":"Field","position":"CTD.3","name":"Contact Address","length":250,"usage":"O","rpt":"*","dataType":"XAD","dataTypeName":"Extended Address","tableId":null,"tableName":null,"description":"This field contains the mailing address of the contact person identified in this segment. One of the key components for completing the circle of care and provider/institution bonding is the issuance of follow-up correspondence to the referring provider.","sample":"","fields":[{"id":"CTD.3.9","type":"Component","position":"CTD.3.9","name":"County/Parish Code","length":0,"usage":"O","rpt":"1","dataType":"IS","dataTypeName":"Coded value for user-defined tables","tableId":"0289","tableName":"County/parish","description":"A code that represents the county in which the specified address resides . User-defined Table 0289 - County/parish is used as the HL7 identifier for the user-defined table of values for this component. When this component is used to represent the county (or parish), component 8 <other geographic designation> should not duplicate it (i.e., the use of <other geographic designation> to represent the county is allowed only for the purpose of backward compatibility, and should be discouraged in this and future versions of HL7).","sample":"","fields":[]},{"id":"CTD.3.7","type":"Component","position":"CTD.3.7","name":"Address Type","length":0,"usage":"O","rpt":"1","dataType":"ID","dataTypeName":"Coded values for HL7 tables","tableId":"0190","tableName":"Address type","description":"Address type is optional and defined by HL7 Table 0190 - Address type.","sample":"","fields":[]}]},{"id":"CTD.4","type":"Field","position":"CTD.4","name":"Contact Location","length":60,"usage":"O","rpt":"1","dataType":"PL","dataTypeName":"Person Location","tableId":null,"tableName":null,"description":"This field contains the location of the contact, which is required when a contact that may be external to a given enterprise must be referenced. For example, if this contact represents the office manager of the referred-to physician, then the contact location should identify the clinic of the physician or provider to whom this referral has been sent. The identification of the contacts location is specified by an application and facility identifier carried in the facility field. The application identifier and the facility identifier would be used in the same manner as their corresponding fields in the MSH segment ( MSH-3-Sending application, MSH-5-Receiving application, MSH-4-Sending facility, MSH-6-Receiving facility ). That is, the facility field will contain an application identifier and facility identifier which describe the location of this contact. However, it should be noted that they may describe a different location because the contact location being referenced in this field may not be the location from which the message originated, which is being described by the MSH.","sample":"","fields":[]},{"id":"CTD.5","type":"Field","position":"CTD.5","name":"Contact Communication Information","length":250,"usage":"O","rpt":"*","dataType":"XTN","dataTypeName":"Extended Telecommunication Number","tableId":null,"tableName":null,"description":"This field contains the information, such as the phone number or electronic mail address, used to communicate with the contact person or organization.","sample":"","fields":[]},{"id":"CTD.6","type":"Field","position":"CTD.6","name":"Preferred Method of Contact","length":250,"usage":"O","rpt":"1","dataType":"CE","dataTypeName":"Coded Element","tableId":"0185","tableName":"Preferred method of contact","description":"This field contains the preferred method to use when communicating with the contact person. Refer to User-defined Table 0185 - Preferred method of contact for suggested values.","sample":"","fields":[]},{"id":"CTD.7","type":"Field","position":"CTD.7","name":"Contact Identifiers","length":100,"usage":"O","rpt":"*","dataType":"PI","dataTypeName":"Person Identifier","tableId":null,"tableName":null,"description":null,"sample":"","fields":[]}]}